Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: The dynamicCallable attribute’s methods specify only the type used to hold the array of arguments.
ja: dynamicCallable属性のもつメソッドは、引数それらからなる配列を保持するために使われる型だけを指定します。

source: The grid array for this Matrix instance is effectively a flattened version of the matrix, as read from top left to bottom right:
ja: このMatrixインスタンスのためのgrid配列は、実際にはこのMatrix 行列の、左上から右下へと読まれる、平らにされた改変板です：

source: The let keyword is only used for constant properties, to indicate that their values cannot be changed once they are set as part of instance initialization.
ja: letキーワードは定数プロパティのためにだけ使われます、そして一旦それがインスタンス初期化の一部として設定されるならば、その値が変わることができないことを示します。

source: The lowerThan precedence group attribute may only be used to refer to precedence groups declared outside of the current module.
ja: lowerThan優先順位グループ属性は、現在のモジュールの外側で宣言される優先順位グループを参照するのに使われるだけでしょう。

source: The nonobjc attribute tells the compiler to make the declaration unavailable in Objective-C code, even though it’s possible to represent it in Objective-C.
ja: nonobjc属性は、コンパイラにその宣言がObjective-Cコードにおいて利用不可にされることを伝えます、たとえそれがObjective-Cにおいて表現可能であってもです。

source: The optional modifier can be applied only to members that are marked with the objc attribute, and only to members of protocols that are marked with the objc attribute.
ja: optional修飾子は、objc属性で印されるメンバにだけ、そしてobjc属性で印されるプロトコルのメンバにだけ適用されることができます。

source: The possibleIntegerValue variable has an implicit initial value of nil by virtue of being an optional type, and so the optional binding will succeed only if possibleIntegerValue was set to an actual value by one of the switch statement’s first four cases.
ja: possibleIntegerValue変数は、オプショナル型であることの長所によって暗黙的な初期値のnilを持ちます、そのためpossibleIntegerValueがswitch文の最初の４つのケース節の内の１つによって実際の値に設定された場合にのみこのオプショナル束縛は成功します。

source: The @escaping attribute is described above in Escaping Closures.
ja: @escaping属性は、上の脱出クロージャで解説されます。

source: The AutomaticCar class represents a car with an automatic gearbox, which automatically selects an appropriate gear to use based on the current speed:
ja: AutomaticCarクラスはオートマチック・ギアボックスをもつ車を表します、それは、現在の速度に基づいて自動的に使用するのに適切なギアを選びます。

source: The AutomaticallyNamedDocument subclass overrides both of the designated initializers introduced by Document.
ja: AutomaticallyNamedDocumentサブクラスは、Documentで導入される指定イニシャライザを両方ともオーバーライドします。

source: The Bank class manages a made-up currency, which can never have more than 10,000 coins in circulation.
ja: Bankクラスは、ある架空の通貨を管理します、そしてそれは、流通する10,000個以上のコインを決して持つことができません。

source: The Car class introduces a new stored property called gear, with a default integer value of 1.
ja: Carクラスは、gearと呼ばれる、1の省略時の値を持つ、新しい格納プロパティを導入します。

source: The CartItem class models an item in an online shopping cart.
ja: CartItemクラスは、あるオンライン買物かごの中のひとつの項目をモデル化します。

source: The Counter class also defines a method called increment, which increments the count property every time the method is called.
ja: Counterクラスはまた、incrementと呼ばれるメソッドを定義します、それは、メソッドが呼ばれるたびにcountプロパティを増加させます。

source: The Matrix structure’s subscript takes two integer parameters:
ja: Matrix構造体の添え字は、２つの整数パラメータをとります：

source: The Person class also has a deinitializer that prints a message when an instance of the class is deallocated.
ja: Personクラスはまた、クラスのインスタンスが割り当て解除されるとき、メッセージを出力するデイニシャライザを持ちます。

source: The Player class also implements a deinitializer, which is called just before a Player instance is deallocated.
ja: Playerクラスはまた、デイニシャライザを実装します、それはPlayerインスタンスが割り当て解除される直前に呼ばれます。

source: The RecipeIngredient class models an ingredient in a cooking recipe.
ja: RecipeIngredientクラスは、料理のレシピの材料をモデル化します。

source: The ShoppingListItem class models a recipe ingredient as it appears in a shopping list.
ja: ShoppingListItemクラスは、それが購入品目リストに現れるように、レシピの材料をモデル化します。

source: The Values structure defines two properties to represent this:
ja: Values構造体は、これを表すために２つのプロパティを定義します：

source: The a in the inner scope is initialized with the value of the a in the outer scope when the closure is created, but their values are not connected in any special way.
ja: 内側のスコープの中のaは、クロージャが作成される時に外側のスコープの中のaの値で初期化されます、しかしそれらの値は何ら特別な方法で結びつけられません。

source: The arch(i386) platform condition returns true when code is compiled for the 32–bit iOS simulator.
ja: arch(i386)プラットホーム条件は、コードが32ビットiOSシミュレーターに対してコンパイルされるときtrueを返します。

source: The as! operator returns a value of the specified type, not an optional type.
ja: as!演算子は指定された型の値を返します、オプショナル型ではなく。

source: The as? operator returns an optional of the specified type.
ja: as?演算子は、指定された型のオプショナルを返します。

source: The fallthrough keyword simply causes code execution to move directly to the statements inside the next case (or default case) block, as in C’s standard switch statement behavior.
ja: fallthroughキーワードは、Cの標準のswitch文の挙動でのように、単に次のケース節（またはdefaultケース節）ブロックの中の文へ、コード実行を直接に移すことを引き起こします。

source: The game parameter has a type of DiceGame, not SnakesAndLadders, and so gameDidStart(_:) can access and use only methods and properties that are implemented as part of the DiceGame protocol.
ja: gameパラメータは、型DiceGameを持ちます、SnakesAndLaddersではありません、なので、gameDidStart(_:)はDiceGameプロトコルの一部として実施されるメソッドとプロパティだけにアクセスして使用することができます。

source: The increment() method uses optional chaining to try to call increment(forCount:), and passes the current count value as the method’s single argument.
ja: increment()メソッドは、オプショナル連鎖を使ってincrement(forCount:)を呼ぶことを試みます、そしてメソッドのもつただ１つの引数として現在のcount値を渡します。

source: The is pattern appears only in switch statement case labels.
ja: isパターンは、switch文のケース節ラベルだけで見かけます。

source: The is pattern behaves like the is operator in that they both perform a type cast but discard the returned type.
ja: isパターンは、それらが両方とも型キャストを実行するが返された型を捨てるという点において、is演算子のようにふるまいます。

source: The makeIterator() function provides access to a container’s iterator.
ja: makeIterator()関数は、コンテナの持つイテレータに対するアクセスを提供します。

source: The mutating keyword is only used by structures and enumerations.
ja: mutatingキーワードは、構造体と列挙によって使われるだけです。

source: The objcMembers attribute is a convenience for libraries that make heavy use of the introspection facilities of the Objective-C runtime.
ja: objcMembers属性は、Objective-Cランタイムの自己観察便宜の重度の使用を生じさせるライブラリにとって好都合です。

source: The separator and terminator parameter have default values, so you can omit them when you call this function.
ja: separatorとterminatorパラメータは省略時の値を持ちます、それであなたはそれらを省略することが、この関数をあなたが呼び出す時に可能です。

source: The someContainer argument is of type C1, and the anotherContainer argument is of type C2.
ja: someContainer引数は型C1です、そしてanotherContainer引数は型C2です。

source: The square variable is initialized with an origin point of (0, 0), and a width and height of 10.
ja: square変数は、(0, 0)の原点、そして10の幅と高さで初期化されます。

source: The stepForward(_:) function returns a value one more than its input value, and the stepBackward(_:) function returns a value one less than its input value.
ja: stepForward(_:)関数は、その入力された値より１大きい値を返します、そしてstepBackward(_:)関数はその入力された値より１小さい値を返します。

source: The suffix(_:) method returns a given number of elements from the end of the container, storing them in an instance of the Suffix type.
ja: suffix(_:)メソッドは、コンテナの終わりから指定の数の要素を、それらをSuffix型のインスタンスの中に格納して、返します。

source: The switch statement determines which branch should be selected.
ja: switch文は、どの分岐が選ばれるべきか決定します。

source: The while loop has a statement label called gameLoop to indicate that it is the main game loop for the Snakes and Ladders game.
ja: whileループは、gameLoopと呼ばれる文ラベルを持ち、それが「ヘビとはしご」ゲームのための主なゲーム・ループであることを示します。

source: The init() initializer provides a default placeholder name for a new food by delegating across to the Food class’s init(name: String) with a name value of [Unnamed]:
ja: init()イニシャライザは、Foodクラスのinit(name: String)に[Unnamed]のname値を使って横に委任することで、省略時のプレースホルダ名を新しい食物のために用意します：

source: The Address class type for this property is defined below.
ja: このプロパティのためのAddressクラス型は、下で定義されます。

source: The Aged protocol has a single requirement for a gettable Int property called age.
ja: Agedプロトコルは、取得可能なIntプロパティでageと呼ばれるものに対するただ１つの要件を持ちます。

source: The Animal structure also defines a failable initializer with a single parameter called species.
ja: Animal構造体はまた、speciesと呼ばれるただ１つのパラメータを持つ、失敗できるイニシャライザを定義します。

source: The Country class implements the area requirement directly as a stored property.
ja: Countryクラスは、area要件を格納プロパティとして直接に満たします。

source: The Equatable protocol requires any conforming implementation of == to be an equivalence relation.
ja: Equatableプロトコルは、==のどんな準拠実装もひとつの同等性関係であることを要求します。

source: The Tandem subclass also adds a new stored property called currentNumberOfPassengers, with a default value of 0.
ja: Tandemサブクラスはまた、currentNumberOfPassengersと呼ばれる新しい格納プロパティを、0の省略時の値を使って追加します。

source: The chooseStepFunction(backward:) function returns the stepForward(_:) function or the stepBackward(_:) function based on a Boolean parameter called backward:
ja: chooseStepFunction(backward:)はstepForward(_:)関数あるいはstepBackward(_:)関数を、backwardと呼ばれるブールのパラメータに基づいて返します：

source: The didSet observer does not provide a custom parameter name for the old value, and the default name of oldValue is used instead.
ja: didSetオブザーバーはあつらえのパラメータ名を古い値のために用意しません、そして省略時の名前のoldValueがその代わりに使われます。

source: The didSet observer is called immediately after the new value is set.
ja: didSetオブザーバーは、新しい値が設定された直後に呼ばれます。

source: The endIndex property is the position after the last character in a String.
ja: endIndexプロパティは、あるStringの最後の文字の後の位置を返します。

source: The findIndex(ofString:in:) function returns an optional Int value, which will be the index of the first matching string in the array if it’s found, or nil if the string can’t be found:
ja: findIndex(ofString:in:)関数は、オプショナルのInt値を返します、それは、それが見つけられるならば配列での最初の合致している文字列のインデックスです、または文字列が見つけられることができないならばnilです：

source: The mutating keyword is added to its definition to enable it to modify its properties.
ja: mutatingキーワードがその定義に加えられ、それにそのプロパティを修正するのを可能にします。

source: The objectWithArea constant is known to be of type HasArea, and so its area property can be accessed and printed in a type-safe way.
ja: 定数のobjectWithAreaは、型HasAreaであるということを知られています、なので、そのareaプロパティは型安全な方法でアクセスされて出力されることができます。

source: The return statement is described in Functions, and the throw statement is described in Propagating Errors Using Throwing Functions.
ja: return文は関数において、そしてthrow文はスロー関数を使ってエラーを伝えるにおいて記述されます。

source: The switch statement is better suited to more complex conditions with multiple possible permutations and is useful in situations where pattern matching can help select an appropriate code branch to execute.
ja: switch文は、複数の可能な起こりうる組み合わせを伴うさらに複雑な状況によりよく適します、そして、パターンマッチングが適切なコード分岐を選択して実行する助けとなり得る状況において役立ちます。

source: The Dictionary type uses an optional subscript type to model the fact that not every key will have a value, and to give a way to delete a value for a key by assigning a nil value for that key.
ja: Dictionary型は、すべてのキーに値があるというわけでないという事実をモデル化するために、そしてあるキーに対する値を削除する方法をそのキーに対してnilの値を代入することで提供するために、オプショナルの添え字型を使います。

source: The * argument is required and specifies that on any other platform, the body of the code block guarded by the availability condition executes on the minimum deployment target specified by your target.
ja: *引数は必須であらゆる他のプラットホーム上を指定します、有効性条件によって保護されたコード・ブロックの本文はあなたのターゲットによって指定される最小の開発ターゲット上で実行します。

source: The Car class’s version of description then adds some extra text onto the end of this description to provide information about the current gear.
ja: Carクラス版のdescriptionは、それからこの説明の最後に現在のギアーについての情報を提供するために追加のテキストを加えられます。

source: The Food class does not have a superclass, and so the init(name: String) initializer does not need to call super.init() to complete its initialization.
ja: Foodクラスには、スーパークラスがありません、なので、init(name: String)イニシャライザはその初期化を完了するためにsuper.init()を呼ぶ必要がありません。

source: The advance(to:) method returns a Boolean value to indicate whether or not it was actually able to set currentLevel.
ja: advance(to:)メソッドは、それが実際にcurrentLevelを設定することができたかどうか示すためにブールの値を返します。

source: The asHTML property is of type () -> String, or “a function that takes no parameters, and returns a String value”.
ja: asHTMLプロパティは型() -> Stringです、あるいは「パラメータをとらなくて、String値を返す関数」。

source: The currentSpeed property’s value is used by a read-only computed String property called description to create a description of the vehicle.
ja: currentSpeedプロパティの値は、descriptionと呼ばれる読み込み専用の計算Stringプロパティによってその乗り物の解説を作成するために使用されます。

source: The fullName property uses the prefix value if it exists, and prepends it to the beginning of name to create a full name for the starship.
ja: fullNameプロパティは、prefix値を、それが存在するならば使います、そしてそれをnameの始めに付けて、その宇宙船の完全な名前をつくります。

source: The is and as patterns have the following form:
ja: isとasパターンは以下の形式を持ちます：

source: The numberOfWheels property is used by a computed property called description to create a String description of the vehicle’s characteristics:
ja: numberOfWheelsプロパティはdescriptionと呼ばれる計算プロパティによって使用されて、この乗り物の特徴のあるStringの解説を作成します：

source: The shareHealth(with:) method below takes another Player instance as an in-out parameter, creating the possibility of overlapping accesses.
ja: 下のshareHealth(with:)メソッドは、別のPlayerインスタンスをin-outパラメータとして取り、オーバーラップアクセスの可能性を作り出しています。

source: The Snakes and Ladders game board setup takes place within the class’s init() initializer.
ja: ヘビとはしごゲーム盤設定は、このクラスのinit()イニシャライザ内で行われます。

source: The assignment operator (a = b) initializes or updates the value of a with the value of b:
ja: 代入演算子（a = b)）は、aの値をbの値で初期化または更新します：

source: The assignment operator sets a new value for a given expression.
ja: 代入演算子は、指定された式に対してある新しい値を設定します。

source: The assignment of a precedence group specifies the precedence of an operator when used in an operation that includes optional chaining.
ja: 優先順位グループのassignmentは、オプショナル連鎖を含む演算において使われる時ある演算子の優先順位を指定します。

source: The associativity of an operator specifies how a sequence of operators with the same precedence level are grouped together in the absence of grouping parentheses.
ja: 演算子の結合性は、グループ括弧がない場合に同じ優先順位レベルを持つひと連なりの演算子がどのようにまとめられるかを指定します。

source: The bitwise AND operator (&) combines the bits of two numbers.
ja: ビット単位の論理積演算子（&）は、２つの数のビットを結合します。

source: The bitwise NOT operator (~) inverts all bits in a number:
ja: ビット単位の論理否定演算子（~）は、ある数の中の全てのビットを逆にします：

source: The bitwise OR operator (|) compares the bits of two numbers.
ja: ビット単位の論理和演算子（|）は、２つの数のビットを比較します。

source: The bitwise XOR operator, or “exclusive OR operator” (^), compares the bits of two numbers.
ja: ビット単位の排他的論理和（XOR）演算子、あるいは「排他的論理和演算子」（^）は、２つの数のビットを比較します。

source: The bitwise left shift operator (<<) and bitwise right shift operator (>>) move all bits in a number to the left or the right by a certain number of places, according to the rules defined below.
ja: ビット単位の左シフト演算子（<<）とビット単位の右シフト演算子（>>）は、下で定義される規則に従ってある数の中の全てのビットを左または右に特定の桁数だけ移動します（シフト：移す、ずらす）。

source: The closed range operator (a...b) defines a range that runs from a to b, and includes the values a and b.
ja: 完結範囲演算子（a...b）は、aからbまで続く範囲を定義します、それはaとbの値を含んでいます。

source: The compilation condition can include the true and false Boolean literals, an identifier used with the -D command line flag, or any of the platform conditions listed in the table below.
ja: compilation conditionは、trueとfalseのブールのリテラル、-Dコマンドラインフラグと共に使われる識別子、もしくは以下の表で列記されるプラットホーム条件を含むことができます。

source: The condition is evaluated.
ja: 条件が評価されます。

source: The constraint is a class type, protocol type, protocol composition type, or Any.
ja: constraint（制約）は、クラス型、プロトコル型、プロトコル合成型、またはAnyです。

source: The constraint specifies that a type parameter inherits from a specific class or conforms to a protocol or protocol composition.
ja: 制約は、型パラメータが特定のクラスから継承する、もしくはあるプロトコルまたはプロトコル合成に準拠することを指定します。

source: The control expression of the switch statement is evaluated and then compared with the patterns specified in each case.
ja: switch文の制御式は、評価されて、それからそれぞれのケース節（case）で指定されるパターンと比較されます。

source: The fixity of an operator specifies the relative position of an operator to its operands.
ja: 演算子の定着性は、その演算子の演算数に対する相対位置を指定します。

source: The function name can be any expression whose value is of a function type.
ja: 関数名は、値がその関数型であるどんな式でもかまいません。

source: The generic argument list is a comma-separated list of type arguments.
ja: 総称体引数リストは、型引数のコンマで区切られたリストです。

source: The generic parameter list is a comma-separated list of generic parameters, each of which has the following form:
ja: 総称体パラメータリストは、コンマで区切られた総称体パラメータのリストです、そしてそのそれぞれは以下の形式を持ちます：

source: The half-open range operator (a..<b) defines a range that runs from a to b, but doesn’t include b.
ja: 半開範囲演算子（a..<b）は、aからbまで続く範囲を定義します、しかしbの値を含みません。

source: The lexical structure of Swift describes what sequence of characters form valid tokens of the language.
ja: スウィフトの語彙の構造は、どんな文字の連なりがこの言語の公式のトークン（個々の語、最少単位の語）を作り上げるかについて述べます。

source: The logical AND operator (a && b) creates logical expressions where both values must be true for the overall expression to also be true.
ja: 論理積演算子（a && b）は、論理式をつくります、そこにおいて全体的な式もまたtrueになるためには、両方の値がtrueでなければなりません。

source: The logical NOT operator (!a) inverts a Boolean value so that true becomes false, and false becomes true.
ja: 論理否定演算子（!a）は１つのブール値を逆にします、それでtrueはfalseに、falseはtrueになります。

source: The logical OR operator (a || b) is an infix operator made from two adjacent pipe characters.
ja: 論理和演算子（a || b）は、２つの隣接したパイプ文字から作られる接中辞演算子です。

source: The lower group names and higher group names lists specify the new precedence group’s relation to existing precedence groups.
ja: 下方グループ名および上方グループ名リストは、新しい優先順位グループのもつ関係を既存の優先順位グループに対して指定します。

source: The message consists of a string literal.
ja: messageは、文字列リテラルから成ります。

source: The method name and property name must be a reference to a method or a property that is available in the Objective-C runtime.
ja: method nameとproperty nameは、あるメソッドおよびプロパティへの参照で、それはObjective-Cランタイムにおいて利用可能なものでなければなりません。

source: The method name can contain parentheses for grouping, as well the as operator to disambiguate between methods that share a name but have different type signatures.
ja: method nameは、グループにまとめるための丸括弧、その上に、名前を共有するが異なる型シグネチャを持つメソッド間の違いを明確にするためにas演算子を含むことができます。

source: The new name consists of a string literal.
ja: 新しい名前は文字列リテラルからなります。

source: The nil-coalescing operator (a ?? b) unwraps an optional a if it contains a value, or returns a default value b if a is nil.
ja: nil合体演算子（a ?? b）は、それが値を持つならばオプショナルのaをアンラップします、またはaがnilならば省略時の値のbを返します。

source: The parameter type is comma-separated list of types.
ja: parameter typeはコンマ区切りの型のリストです。

source: The parameters have the same form as the parameters in a function declaration, as described in Function Declaration.
ja: パラメータは、関数宣言で記述されるように、関数宣言でのパラメータと同じ形式を持ちます。

source: The parameters in closure expression syntax can be in-out parameters, but they can’t have a default value.
ja: クロージャ式構文中のparametersはin-outパラメータであることができます、しかしそれらは省略時の値を持つことはできません。

source: The parameters specify one or more indexes used to access elements of the corresponding type in a subscript expression (for example, the i in the expression object[i]).
ja: パラメータは、対応する型の要素にアクセスするために添え字式において使用する一種類以上のインデックスを指定します（例えば、式object[i]におけるiなど）。

source: The path can contain multiple property names, separated by periods, to refer to a property of a property’s value.
ja: pathは、ピリオドで区切った複数のプロパティ名を含むことで、あるプロパティの持つ値に属するプロパティを参照できます。

source: The path can include subscripts using brackets, as long as the subscript’s parameter type conforms to the Hashable protocol.
ja: pathは角括弧を使う添え字を含むことができます、その添え字の持つパラメータ型がHashableプロトコルに準拠する限りは。

source: The path can refer to self to create the identity key path (\.self).
ja: pathは、selfを参照することで、同一性キーパス（\.self）を作成できます。

source: The path can use optional chaining and forced unwrapping.
ja: pathは、オプショナル連鎖と強制アンラップを使うことができます。

source: The path consists of property names, subscripts, optional-chaining expressions, and forced unwrapping expressions.
ja: pathは、プロパティ名、添え字、「オプショナル連鎖」式、そして強制アンラップ式からなります。

source: The projected value for a wrapped property is a second value that a property wrapper can use to expose additional functionality.
ja: あるラップされたプロパティに対する予測値は、２番目の値です、それはプロパティラッパーが使用することで追加的機能性を露出できるものです。

source: The property name must be a reference to a property that is available in the Objective-C runtime.
ja: property nameは、Objective-Cランタイムにおいて利用可能であるプロパティへの参照でなければなりません。

source: The remainder operator (a % b) works out how many multiples of b will fit inside a and returns the value that is left over (known as the remainder).
ja: 剰余演算子（a % b）は、どのくらい多くのbの倍数がaの内部に収まるかを計算して、残された値（余りとして知られるもの）を返します。

source: The requirements in a generic where clause specify that a type parameter inherits from a class or conforms to a protocol or protocol composition.
ja: 総称体where節の中の要件が指定するのは、型パラメータがクラスから継承するかまたはプロトコルやプロトコル合成に準拠するということです。

source: The setter name and enclosing parentheses are optional.
ja: セッター名と囲んでいる括弧は、任意です。

source: The setter name and enclosing parentheses in the willSet and didSet clauses are optional.
ja: willSetとdidSet節の中のセッター名と囲んでいる丸括弧は任意です。

source: The setter name and enclosing parentheses is optional.
ja: セッター名、そして囲んでいる丸括弧は任意です。

source: The statements inside a code block include declarations, expressions, and other kinds of statements and are executed in order of their appearance in source code.
ja: コード・ブロックの内側の文は、宣言、式、そして他の種類の文を含みます、そしてソース・コードにおいてそれらの現れる順に実行されます。

source: The ternary conditional operator evaluates to one of two given values based on the value of a condition.
ja: 三項条件演算子は、ある条件の値に基づいて、２つの与えられた値のうちの１つへと評価されます。

source: The ternary conditional operator is a special operator with three parts, which takes the form question ? answer1 : answer2.
ja: 三項条件演算子は３つの部分をもつ特別な演算子です、それは形式question ? answer1 : answer2をとります。

source: The type name can be omitted in contexts where type inference can determine the implied type.
ja: type nameは、型推論が暗黙の型を判定できるところの文脈では省略できます。

source: The type name is the name of a concrete type, including any generic parameters, such as String, [Int], or Set<Int>.
ja: type nameは、ある具象型の名前で、何らかの総称体パラメータを含みます、例えばString、[Int]、またはSet<Int>など。

source: The unary plus operator (+) simply returns the value it operates on, without any change:
ja: 単項プラス演算子（+）は、それが作用する値を、どんな変更もせずに、ただ単純に返します：

source: The version number consists of one to three positive integers, separated by periods.
ja: バージョン番号は、ビリオドで区切られた、１つから３つの正の整数から成ります。

source: The superclass appears first after the class name and colon, followed by any adopted protocols.
ja: スーパークラスがまずクラス名とコロンの後に現れ、続いて随意の準拠するプロトコルが続きます。

source: The type annotation is optional when the type can be inferred from the initializer expression.
ja: 型注釈は、その型が初期化式から推論されることができる場合は随意です。

source: The existing type can be a named type or a compound type.
ja: 既存の型は、名前付きの型または複合の型でありえます。

source: The protocol member declarations are discussed in detail below.
ja: プロトコルメンバー宣言は、詳細に下で議論されます。

source: The wrapped value of the property is the value that the getter and setter for this property expose.
ja: そのプロパティのラップされた値は、このプロパティに対するゲッターとセッターが露出する値です。

source: The line number changes the value of #line and is any integer literal greater than zero.
ja: line number（行番号）は、#lineの値を変更します、そして0より大きい何らかの整数リテラルです。

source: The return type specifies the type of the element being accessed.
ja: 戻り型は、アクセスされている要素の型を指定します。

source: The filename changes the value of #file and is a string literal.
ja: filename（ファイル名）は、#fileの値を変更します、そしてひとつの文字列リテラルです。

source: The Basics
ja: 基本

source: The CSS color value #CC6699 is written as 0xCC6699 in Swift’s hexadecimal number representation.
ja: CSS色値#CC6699は、スウィフトの16進数表現では0xCC6699のように書かれます。

source: The DSO (dynamic shared object) handle in use where it appears.
ja: DSO（動的共有オブジェクト）は、使用されている場所で取り扱われます。

source: The Problem That Generics Solve
ja: 総称体が解決する問題

source: The Problem That Opaque Types Solve
ja: 不透明型が解決する問題

source: The Sorted Method
ja: 分類メソッド
